In [1]:
import numpy as np
import pandas as pd
import time as tm

In [2]:
df=pd.read_csv('students.csv')

In [9]:
dff=df.iloc[0:5, 0:3]

In [10]:
dff

               name  age       sport
0  Emmanuel Ayomide   27    Football
1      Ibrahim Musa   24    Football
2         Sesan Obi   24    Swimming
3       Kevin Frank   25      Tennis
4        Emeka Jude   24  Basketball

In [20]:
# Iter row
# Iter tuple
start=tm.time()
for row_label,row in dff.iterrows():
    print(row_label,row,sep='\n',end='\n')
print('Total time is {}'.format(tm.time()-start))# Iter time checks the time it takes the code to run

0
name     Emmanuel Ayomide
age                    27
sport            Football
Name: 0, dtype: object
1
name     Ibrahim Musa
age                24
sport        Football
Name: 1, dtype: object
2
name     Sesan Obi
age             24
sport     Swimming
Name: 2, dtype: object
3
name     Kevin Frank
age               25
sport         Tennis
Name: 3, dtype: object
4
name     Emeka Jude
age              24
sport    Basketball
Name: 4, dtype: object
Total time is 0.08699584007263184

In [24]:

start=tm.time()
for row in dff.itertuples():
    print(row,sep='\n',end='\n')
print('Total time is {}'.format(tm.time()-start))

Pandas(Index=0, name='Emmanuel Ayomide', age=27, sport='Football')
Pandas(Index=1, name='Ibrahim Musa', age=24, sport='Football')
Pandas(Index=2, name='Sesan Obi', age=24, sport='Swimming')
Pandas(Index=3, name='Kevin Frank', age=25, sport='Tennis')
Pandas(Index=4, name='Emeka Jude', age=24, sport='Basketball')
Total time is 0.013006448745727539

In [25]:
# Let's see the time difference for the whole dataset
start=tm.time()
for row in df.itertuples():
    print(row,sep='\n',end='\n')
print('Total time is {}'.format(tm.time()-start))

Pandas(Index=0, name='Emmanuel Ayomide', age=27, sport='Football', Biology_score=73.0, Maths_score=58.0, English_score=65.0)
Pandas(Index=1, name='Ibrahim Musa', age=24, sport='Football', Biology_score=92.0, Maths_score=56.0, English_score=80.0)
Pandas(Index=2, name='Sesan Obi', age=24, sport='Swimming', Biology_score=67.0, Maths_score=95.0, English_score=71.0)
Pandas(Index=3, name='Kevin Frank', age=25, sport='Tennis', Biology_score=53.0, Maths_score=85.0, English_score=74.0)
Pandas(Index=4, name='Emeka Jude', age=24, sport='Basketball', Biology_score=86.0, Maths_score=80.0, English_score=93.0)
Pandas(Index=5, name='Caroline Obi', age=27, sport='Basketball', Biology_score=92.0, Maths_score=71.0, English_score=79.0)
Pandas(Index=6, name='Franklin Oladele', age=18, sport='Football', Biology_score=96.0, Maths_score=nan, English_score=70.0)
Pandas(Index=7, name='Kola Ola', age=28, sport='Swimming', Biology_score=82.0, Maths_score=95.0, English_score=58.0)
Pandas(Index=8, name='Emmanuel Ovi', age=23, sport='Tennis', Biology_score=79.0, Maths_score=61.0, English_score=68.0)
Pandas(Index=9, name='Kareem Musa', age=24, sport='Football', Biology_score=78.0, Maths_score=73.0, English_score=86.0)
Pandas(Index=10, name='Mustapha Ahmed', age=24, sport=nan, Biology_score=88.0, Maths_score=84.0, English_score=nan)
Pandas(Index=11, name='Femi Akin', age=24, sport='Tennis', Biology_score=90.0, Maths_score=97.0, English_score=85.0)
Pandas(Index=12, name='Tobi Olaniyan', age=22, sport='Volleyball', Biology_score=51.0, Maths_score=79.0, English_score=84.0)
Pandas(Index=13, name='Kayode Ibrahim', age=25, sport='Football', Biology_score=58.0, Maths_score=67.0, English_score=84.0)
Pandas(Index=14, name='Nnamdi Ike', age=26, sport='Swimming', Biology_score=nan, Maths_score=62.0, English_score=88.0)
Pandas(Index=15, name='Ahmed Musa', age=24, sport='Football', Biology_score=60.0, Maths_score=90.0, English_score=81.0)
Pandas(Index=16, name='Kevin Frank', age=25, sport='Tennis', Biology_score=53.0, Maths_score=85.0, English_score=74.0)
Pandas(Index=17, name='Susan James', age=27, sport='Volleyball', Biology_score=76.0, Maths_score=69.0, English_score=54.0)
Pandas(Index=18, name='Zainab Mohammed', age=25, sport='Basketball', Biology_score=64.0, Maths_score=95.0, English_score=94.0)
Pandas(Index=19, name='Sesan Obi', age=26, sport='Swimming', Biology_score=67.0, Maths_score=95.0, English_score=71.0)
Total time is 0.01700115203857422

In [26]:
# Iterating over columns and they return tuples

In [50]:
col_dff=df.iloc[2:7,0:5]

In [51]:
col_dff

               name  age       sport  Biology_score  Maths_score
2         Sesan Obi   24    Swimming           67.0         95.0
3       Kevin Frank   25      Tennis           53.0         85.0
4        Emeka Jude   24  Basketball           86.0         80.0
5      Caroline Obi   27  Basketball           92.0         71.0
6  Franklin Oladele   18    Football           96.0          NaN

In [52]:
for col_label,col in col_dff.iteritems():
    print(col_label,col,sep='\n',end='\n')

name
2           Sesan Obi
3         Kevin Frank
4          Emeka Jude
5        Caroline Obi
6    Franklin Oladele
Name: name, dtype: object
age
2    24
3    25
4    24
5    27
6    18
Name: age, dtype: int64
sport
2      Swimming
3        Tennis
4    Basketball
5    Basketball
6      Football
Name: sport, dtype: object
Biology_score
2    67.0
3    53.0
4    86.0
5    92.0
6    96.0
Name: Biology_score, dtype: float64
Maths_score
2    95.0
3    85.0
4    80.0
5    71.0
6     NaN
Name: Maths_score, dtype: float64

In [53]:
for col_label,col in col_dff.items():
    print(col_label,col,sep='\n',end='\n')

name
2           Sesan Obi
3         Kevin Frank
4          Emeka Jude
5        Caroline Obi
6    Franklin Oladele
Name: name, dtype: object
age
2    24
3    25
4    24
5    27
6    18
Name: age, dtype: int64
sport
2      Swimming
3        Tennis
4    Basketball
5    Basketball
6      Football
Name: sport, dtype: object
Biology_score
2    67.0
3    53.0
4    86.0
5    92.0
6    96.0
Name: Biology_score, dtype: float64
Maths_score
2    95.0
3    85.0
4    80.0
5    71.0
6     NaN
Name: Maths_score, dtype: float64